{
    "class_name": "Functional",
    "config": {
        "name": "functional_1",
        "layers": [
            {
                "class_name": "InputLayer",
                "config": {
                    "batch_input_shape": [
                        null,
                        196,
                        512
                    ],
                    "dtype": "float32",
                    "sparse": false,
                    "ragged": false,
                    "name": "encoder_input"
                },
                "name": "encoder_input",
                "inbound_nodes": []
            },
            {
                "class_name": "Lambda",
                "config": {
                    "name": "lambda",
                    "trainable": true,
                    "dtype": "float32",
                    "function": [
                        "4wEAAAAAAAAAAQAAAAQAAABTAAAAcw4AAAB0AGoBfABkAWQCjQJTACkDTukBAAAAKQHaBGF4aXMp\nAtoBS9oEbWVhbikB2gF4qQByBgAAAPozL2hvbWUvbXN0b3BhL2NvbXB1dGUvSW1hZ2VDYXB0aW9u\nL21vZGVscy9kZWNvZGVyLnB52gg8bGFtYmRhPpgAAADzAAAAAA==\n",
                        null,
                        null
                    ],
                    "function_type": "lambda",
                    "module": "models.decoder",
                    "output_shape": null,
                    "output_shape_type": "raw",
                    "output_shape_module": null,
                    "arguments": {}
                },
                "name": "lambda",
                "inbound_nodes": [
                    [
                        [
                            "encoder_input",
                            0,
                            0,
                            {}
                        ]
                    ]
                ]
            },
            {
                "class_name": "Dense",
                "config": {
                    "name": "dense_4",
                    "trainable": true,
                    "dtype": "float32",
                    "units": 512,
                    "activation": "relu",
                    "use_bias": true,
                    "kernel_initializer": {
                        "class_name": "GlorotUniform",
                        "config": {
                            "seed": null
                        }
                    },
                    "bias_initializer": {
                        "class_name": "Zeros",
                        "config": {}
                    },
                    "kernel_regularizer": null,
                    "bias_regularizer": null,
                    "activity_regularizer": null,
                    "kernel_constraint": null,
                    "bias_constraint": null
                },
                "name": "dense_4",
                "inbound_nodes": [
                    [
                        [
                            "lambda",
                            0,
                            0,
                            {}
                        ]
                    ]
                ]
            },
            {
                "class_name": "BatchNormalization",
                "config": {
                    "name": "batch_normalization_4",
                    "trainable": true,
                    "dtype": "float32",
                    "axis": [
                        1
                    ],
                    "momentum": 0.99,
                    "epsilon": 0.001,
                    "center": true,
                    "scale": true,
                    "beta_initializer": {
                        "class_name": "Zeros",
                        "config": {}
                    },
                    "gamma_initializer": {
                        "class_name": "Ones",
                        "config": {}
                    },
                    "moving_mean_initializer": {
                        "class_name": "Zeros",
                        "config": {}
                    },
                    "moving_variance_initializer": {
                        "class_name": "Ones",
                        "config": {}
                    },
                    "beta_regularizer": null,
                    "gamma_regularizer": null,
                    "beta_constraint": null,
                    "gamma_constraint": null
                },
                "name": "batch_normalization_4",
                "inbound_nodes": [
                    [
                        [
                            "dense_4",
                            0,
                            0,
                            {}
                        ]
                    ]
                ]
            },
            {
                "class_name": "Lambda",
                "config": {
                    "name": "lambda_2",
                    "trainable": true,
                    "dtype": "float32",
                    "function": [
                        "4wEAAAAAAAAAAQAAAAMAAABTAAAAcwwAAAB0AGoBfABkAYMCUwApAk7pAQAAACkC2gFL2gtleHBh\nbmRfZGltcykB2gF4qQByBQAAAPozL2hvbWUvbXN0b3BhL2NvbXB1dGUvSW1hZ2VDYXB0aW9uL21v\nZGVscy9kZWNvZGVyLnB52gg8bGFtYmRhPugAAADzAAAAAA==\n",
                        null,
                        null
                    ],
                    "function_type": "lambda",
                    "module": "models.decoder",
                    "output_shape": null,
                    "output_shape_type": "raw",
                    "output_shape_module": null,
                    "arguments": {}
                },
                "name": "lambda_2",
                "inbound_nodes": [
                    [
                        [
                            "batch_normalization_4",
                            0,
                            0,
                            {}
                        ]
                    ]
                ]
            },
            {
                "class_name": "Dense",
                "config": {
                    "name": "dense_1",
                    "trainable": true,
                    "dtype": "float32",
                    "units": 512,
                    "activation": "linear",
                    "use_bias": true,
                    "kernel_initializer": {
                        "class_name": "GlorotUniform",
                        "config": {
                            "seed": null
                        }
                    },
                    "bias_initializer": {
                        "class_name": "Zeros",
                        "config": {}
                    },
                    "kernel_regularizer": null,
                    "bias_regularizer": null,
                    "activity_regularizer": null,
                    "kernel_constraint": null,
                    "bias_constraint": null
                },
                "name": "dense_1",
                "inbound_nodes": [
                    [
                        [
                            "encoder_input",
                            0,
                            0,
                            {}
                        ]
                    ],
                    [
                        [
                            "encoder_input",
                            0,
                            0,
                            {}
                        ]
                    ],
                    [
                        [
                            "encoder_input",
                            0,
                            0,
                            {}
                        ]
                    ],
                    [
                        [
                            "encoder_input",
                            0,
                            0,
                            {}
                        ]
                    ],
                    [
                        [
                            "encoder_input",
                            0,
                            0,
                            {}
                        ]
                    ],
                    [
                        [
                            "encoder_input",
                            0,
                            0,
                            {}
                        ]
                    ],
                    [
                        [
                            "encoder_input",
                            0,
                            0,
                            {}
                        ]
                    ],
                    [
                        [
                            "encoder_input",
                            0,
                            0,
                            {}
                        ]
                    ],
                    [
                        [
                            "encoder_input",
                            0,
                            0,
                            {}
                        ]
                    ],
                    [
                        [
                            "encoder_input",
                            0,
                            0,
                            {}
                        ]
                    ],
                    [
                        [
                            "encoder_input",
                            0,
                            0,
                            {}
                        ]
                    ],
                    [
                        [
                            "encoder_input",
                            0,
                            0,
                            {}
                        ]
                    ],
                    [
                        [
                            "encoder_input",
                            0,
                            0,
                            {}
                        ]
                    ],
                    [
                        [
                            "encoder_input",
                            0,
                            0,
                            {}
                        ]
                    ],
                    [
                        [
                            "encoder_input",
                            0,
                            0,
                            {}
                        ]
                    ],
                    [
                        [
                            "encoder_input",
                            0,
                            0,
                            {}
                        ]
                    ],
                    [
                        [
                            "encoder_input",
                            0,
                            0,
                            {}
                        ]
                    ],
                    [
                        [
                            "encoder_input",
                            0,
                            0,
                            {}
                        ]
                    ],
                    [
                        [
                            "encoder_input",
                            0,
                            0,
                            {}
                        ]
                    ],
                    [
                        [
                            "encoder_input",
                            0,
                            0,
                            {}
                        ]
                    ],
                    [
                        [
                            "encoder_input",
                            0,
                            0,
                            {}
                        ]
                    ],
                    [
                        [
                            "encoder_input",
                            0,
                            0,
                            {}
                        ]
                    ],
                    [
                        [
                            "encoder_input",
                            0,
                            0,
                            {}
                        ]
                    ],
                    [
                        [
                            "encoder_input",
                            0,
                            0,
                            {}
                        ]
                    ],
                    [
                        [
                            "encoder_input",
                            0,
                            0,
                            {}
                        ]
                    ],
                    [
                        [
                            "encoder_input",
                            0,
                            0,
                            {}
                        ]
                    ],
                    [
                        [
                            "encoder_input",
                            0,
                            0,
                            {}
                        ]
                    ],
                    [
                        [
                            "encoder_input",
                            0,
                            0,
                            {}
                        ]
                    ],
                    [
                        [
                            "encoder_input",
                            0,
                            0,
                            {}
                        ]
                    ],
                    [
                        [
                            "encoder_input",
                            0,
                            0,
                            {}
                        ]
                    ]
                ]
            },
            {
                "class_name": "Dense",
                "config": {
                    "name": "dense",
                    "trainable": true,
                    "dtype": "float32",
                    "units": 512,
                    "activation": "linear",
                    "use_bias": true,
                    "kernel_initializer": {
                        "class_name": "GlorotUniform",
                        "config": {
                            "seed": null
                        }
                    },
                    "bias_initializer": {
                        "class_name": "Zeros",
                        "config": {}
                    },
                    "kernel_regularizer": null,
                    "bias_regularizer": null,
                    "activity_regularizer": null,
                    "kernel_constraint": null,
                    "bias_constraint": null
                },
                "name": "dense",
                "inbound_nodes": [
                    [
                        [
                            "lambda_2",
                            0,
                            0,
                            {}
                        ]
                    ],
                    [
                        [
                            "lambda_5",
                            0,
                            0,
                            {}
                        ]
                    ],
                    [
                        [
                            "lambda_8",
                            0,
                            0,
                            {}
                        ]
                    ],
                    [
                        [
                            "lambda_11",
                            0,
                            0,
                            {}
                        ]
                    ],
                    [
                        [
                            "lambda_14",
                            0,
                            0,
                            {}
                        ]
                    ],
                    [
                        [
                            "lambda_17",
                            0,
                            0,
                            {}
                        ]
                    ],
                    [
                        [
                            "lambda_20",
                            0,
                            0,
                            {}
                        ]
                    ],
                    [
                        [
                            "lambda_23",
                            0,
                            0,
                            {}
                        ]
                    ],
                    [
                        [
                            "lambda_26",
                            0,
                            0,
                            {}
                        ]
                    ],
                    [
                        [
                            "lambda_29",
                            0,
                            0,
                            {}
                        ]
                    ],
                    [
                        [
                            "lambda_32",
                            0,
                            0,
                            {}
                        ]
                    ],
                    [
                        [
                            "lambda_35",
                            0,
                            0,
                            {}
                        ]
                    ],
                    [
                        [
                            "lambda_38",
                            0,
                            0,
                            {}
                        ]
                    ],
                    [
                        [
                            "lambda_41",
                            0,
                            0,
                            {}
                        ]
                    ],
                    [
                        [
                            "lambda_44",
                            0,
                            0,
                            {}
                        ]
                    ],
                    [
                        [
                            "lambda_47",
                            0,
                            0,
                            {}
                        ]
                    ],
                    [
                        [
                            "lambda_50",
                            0,
                            0,
                            {}
                        ]
                    ],
                    [
                        [
                            "lambda_53",
                            0,
                            0,
                            {}
                        ]
                    ],
                    [
                        [
                            "lambda_56",
                            0,
                            0,
                            {}
                        ]
                    ],
                    [
                        [
                            "lambda_59",
                            0,
                            0,
                            {}
                        ]
                    ],
                    [
                        [
                            "lambda_62",
                            0,
                            0,
                            {}
                        ]
                    ],
                    [
                        [
                            "lambda_65",
                            0,
                            0,
                            {}
                        ]
                    ],
                    [
                        [
                            "lambda_68",
                            0,
                            0,
                            {}
                        ]
                    ],
                    [
                        [
                            "lambda_71",
                            0,
                            0,
                            {}
                        ]
                    ],
                    [
                        [
                            "lambda_74",
                            0,
                            0,
                            {}
                        ]
                    ],
                    [
                        [
                            "lambda_77",
                            0,
                            0,
                            {}
                        ]
                    ],
                    [
                        [
                            "lambda_80",
                            0,
                            0,
                            {}
                        ]
                    ],
                    [
                        [
                            "lambda_83",
                            0,
                            0,
                            {}
                        ]
                    ],
                    [
                        [
                            "lambda_86",
                            0,
                            0,
                            {}
                        ]
                    ],
                    [
                        [
                            "lambda_89",
                            0,
                            0,
                            {}
                        ]
                    ]
                ]
            },
            {
                "class_name": "Add",
                "config": {
                    "name": "add",
                    "trainable": true,
                    "dtype": "float32"
                },
                "name": "add",
                "inbound_nodes": [
                    [
                        [
                            "dense_1",
                            0,
                            0,
                            {}
                        ],
                        [
                            "dense",
                            0,
                            0,
                            {}
                        ]
                    ]
                ]
            },
            {
                "class_name": "Lambda",
                "config": {
                    "name": "lambda_3",
                    "trainable": true,
                    "dtype": "float32",
                    "function": [
                        "4wEAAAAAAAAAAQAAAAIAAABTAAAAcwoAAAB0AGoBfACDAVMAKQFOKQLaAUvaBHRhbmgpAdoBeKkA\ncgQAAAD6My9ob21lL21zdG9wYS9jb21wdXRlL0ltYWdlQ2FwdGlvbi9tb2RlbHMvZGVjb2Rlci5w\nedoIPGxhbWJkYT7tAAAA8wAAAAA=\n",
                        null,
                        null
                    ],
                    "function_type": "lambda",
                    "module": "models.decoder",
                    "output_shape": null,
                    "output_shape_type": "raw",
                    "output_shape_module": null,
                    "arguments": {}
                },
                "name": "lambda_3",
                "inbound_nodes": [
                    [
                        [
                            "add",
                            0,
                            0,
                            {}
                        ]
                    ]
                ]
            },
            {
                "class_name": "Dense",
                "config": {
                    "name": "dense_3",
                    "trainable": true,
                    "dtype": "float32",
                    "units": 1,
                    "activation": "linear",
                    "use_bias": true,
                    "kernel_initializer": {
                        "class_name": "GlorotUniform",
                        "config": {
                            "seed": null
                        }
                    },
                    "bias_initializer": {
                        "class_name": "Zeros",
                        "config": {}
                    },
                    "kernel_regularizer": null,
                    "bias_regularizer": null,
                    "activity_regularizer": null,
                    "kernel_constraint": null,
                    "bias_constraint": null
                },
                "name": "dense_3",
                "inbound_nodes": [
                    [
                        [
                            "lambda_3",
                            0,
                            0,
                            {}
                        ]
                    ],
                    [
                        [
                            "lambda_6",
                            0,
                            0,
                            {}
                        ]
                    ],
                    [
                        [
                            "lambda_9",
                            0,
                            0,
                            {}
                        ]
                    ],
                    [
                        [
                            "lambda_12",
                            0,
                            0,
                            {}
                        ]
                    ],
                    [
                        [
                            "lambda_15",
                            0,
                            0,
                            {}
                        ]
                    ],
                    [
                        [
                            "lambda_18",
                            0,
                            0,
                            {}
                        ]
                    ],
                    [
                        [
                            "lambda_21",
                            0,
                            0,
                            {}
                        ]
                    ],
                    [
                        [
                            "lambda_24",
                            0,
                            0,
                            {}
                        ]
                    ],
                    [
                        [
                            "lambda_27",
                            0,
                            0,
                            {}
                        ]
                    ],
                    [
                        [
                            "lambda_30",
                            0,
                            0,
                            {}
                        ]
                    ],
                    [
                        [
                            "lambda_33",
                            0,
                            0,
                            {}
                        ]
                    ],
                    [
                        [
                            "lambda_36",
                            0,
                            0,
                            {}
                        ]
                    ],
                    [
                        [
                            "lambda_39",
                            0,
                            0,
                            {}
                        ]
                    ],
                    [
                        [
                            "lambda_42",
                            0,
                            0,
                            {}
                        ]
                    ],
                    [
                        [
                            "lambda_45",
                            0,
                            0,
                            {}
                        ]
                    ],
                    [
                        [
                            "lambda_48",
                            0,
                            0,
                            {}
                        ]
                    ],
                    [
                        [
                            "lambda_51",
                            0,
                            0,
                            {}
                        ]
                    ],
                    [
                        [
                            "lambda_54",
                            0,
                            0,
                            {}
                        ]
                    ],
                    [
                        [
                            "lambda_57",
                            0,
                            0,
                            {}
                        ]
                    ],
                    [
                        [
                            "lambda_60",
                            0,
                            0,
                            {}
                        ]
                    ],
                    [
                        [
                            "lambda_63",
                            0,
                            0,
                            {}
                        ]
                    ],
                    [
                        [
                            "lambda_66",
                            0,
                            0,
                            {}
                        ]
                    ],
                    [
                        [
                            "lambda_69",
                            0,
                            0,
                            {}
                        ]
                    ],
                    [
                        [
                            "lambda_72",
                            0,
                            0,
                            {}
                        ]
                    ],
                    [
                        [
                            "lambda_75",
                            0,
                            0,
                            {}
                        ]
                    ],
                    [
                        [
                            "lambda_78",
                            0,
                            0,
                            {}
                        ]
                    ],
                    [
                        [
                            "lambda_81",
                            0,
                            0,
                            {}
                        ]
                    ],
                    [
                        [
                            "lambda_84",
                            0,
                            0,
                            {}
                        ]
                    ],
                    [
                        [
                            "lambda_87",
                            0,
                            0,
                            {}
                        ]
                    ],
                    [
                        [
                            "lambda_90",
                            0,
                            0,
                            {}
                        ]
                    ]
                ]
            },
            {
                "class_name": "InputLayer",
                "config": {
                    "batch_input_shape": [
                        null,
                        30
                    ],
                    "dtype": "float32",
                    "sparse": false,
                    "ragged": false,
                    "name": "decoder_input"
                },
                "name": "decoder_input",
                "inbound_nodes": []
            },
            {
                "class_name": "Lambda",
                "config": {
                    "name": "weights_0",
                    "trainable": true,
                    "dtype": "float32",
                    "function": [
                        "4wEAAAAAAAAAAQAAAAQAAABTAAAAcw4AAAB0AGoBfABkAWQCjQJTACkDTukBAAAAKQHaBGF4aXMp\nAtoBS9oHc29mdG1heCkB2gF4qQByBgAAAPozL2hvbWUvbXN0b3BhL2NvbXB1dGUvSW1hZ2VDYXB0\naW9uL21vZGVscy9kZWNvZGVyLnB52gg8bGFtYmRhPvAAAADzAAAAAA==\n",
                        null,
                        null
                    ],
                    "function_type": "lambda",
                    "module": "models.decoder",
                    "output_shape": null,
                    "output_shape_type": "raw",
                    "output_shape_module": null,
                    "arguments": {}
                },
                "name": "weights_0",
                "inbound_nodes": [
                    [
                        [
                            "dense_3",
                            0,
                            0,
                            {}
                        ]
                    ]
                ]
            },
            {
                "class_name": "Embedding",
                "config": {
                    "name": "embedding",
                    "trainable": true,
                    "batch_input_shape": [
                        null,
                        null
                    ],
                    "dtype": "float32",
                    "input_dim": 7373,
                    "output_dim": 512,
                    "embeddings_initializer": {
                        "class_name": "RandomUniform",
                        "config": {
                            "minval": -0.05,
                            "maxval": 0.05,
                            "seed": null
                        }
                    },
                    "embeddings_regularizer": null,
                    "activity_regularizer": null,
                    "embeddings_constraint": null,
                    "mask_zero": true,
                    "input_length": null
                },
                "name": "embedding",
                "inbound_nodes": [
                    [
                        [
                            "decoder_input",
                            0,
                            0,
                            {}
                        ]
                    ]
                ]
            },
            {
                "class_name": "Dot",
                "config": {
                    "name": "dot",
                    "trainable": true,
                    "dtype": "float32",
                    "axes": 1,
                    "normalize": false
                },
                "name": "dot",
                "inbound_nodes": [
                    [
                        [
                            "weights_0",
                            0,
                            0,
                            {}
                        ],
                        [
                            "encoder_input",
                            0,
                            0,
                            {}
                        ]
                    ]
                ]
            },
            {
                "class_name": "Dense",
                "config": {
                    "name": "dense_2",
                    "trainable": true,
                    "dtype": "float32",
                    "units": 512,
                    "activation": "sigmoid",
                    "use_bias": true,
                    "kernel_initializer": {
                        "class_name": "GlorotUniform",
                        "config": {
                            "seed": null
                        }
                    },
                    "bias_initializer": {
                        "class_name": "Zeros",
                        "config": {}
                    },
                    "kernel_regularizer": null,
                    "bias_regularizer": null,
                    "activity_regularizer": null,
                    "kernel_constraint": null,
                    "bias_constraint": null
                },
                "name": "dense_2",
                "inbound_nodes": [
                    [
                        [
                            "lambda_2",
                            0,
                            0,
                            {}
                        ]
                    ],
                    [
                        [
                            "lambda_5",
                            0,
                            0,
                            {}
                        ]
                    ],
                    [
                        [
                            "lambda_8",
                            0,
                            0,
                            {}
                        ]
                    ],
                    [
                        [
                            "lambda_11",
                            0,
                            0,
                            {}
                        ]
                    ],
                    [
                        [
                            "lambda_14",
                            0,
                            0,
                            {}
                        ]
                    ],
                    [
                        [
                            "lambda_17",
                            0,
                            0,
                            {}
                        ]
                    ],
                    [
                        [
                            "lambda_20",
                            0,
                            0,
                            {}
                        ]
                    ],
                    [
                        [
                            "lambda_23",
                            0,
                            0,
                            {}
                        ]
                    ],
                    [
                        [
                            "lambda_26",
                            0,
                            0,
                            {}
                        ]
                    ],
                    [
                        [
                            "lambda_29",
                            0,
                            0,
                            {}
                        ]
                    ],
                    [
                        [
                            "lambda_32",
                            0,
                            0,
                            {}
                        ]
                    ],
                    [
                        [
                            "lambda_35",
                            0,
                            0,
                            {}
                        ]
                    ],
                    [
                        [
                            "lambda_38",
                            0,
                            0,
                            {}
                        ]
                    ],
                    [
                        [
                            "lambda_41",
                            0,
                            0,
                            {}
                        ]
                    ],
                    [
                        [
                            "lambda_44",
                            0,
                            0,
                            {}
                        ]
                    ],
                    [
                        [
                            "lambda_47",
                            0,
                            0,
                            {}
                        ]
                    ],
                    [
                        [
                            "lambda_50",
                            0,
                            0,
                            {}
                        ]
                    ],
                    [
                        [
                            "lambda_53",
                            0,
                            0,
                            {}
                        ]
                    ],
                    [
                        [
                            "lambda_56",
                            0,
                            0,
                            {}
                        ]
                    ],
                    [
                        [
                            "lambda_59",
                            0,
                            0,
                            {}
                        ]
                    ],
                    [
                        [
                            "lambda_62",
                            0,
                            0,
                            {}
                        ]
                    ],
                    [
                        [
                            "lambda_65",
                            0,
                            0,
                            {}
                        ]
                    ],
                    [
                        [
                            "lambda_68",
                            0,
                            0,
                            {}
                        ]
                    ],
                    [
                        [
                            "lambda_71",
                            0,
                            0,
                            {}
                        ]
                    ],
                    [
                        [
                            "lambda_74",
                            0,
                            0,
                            {}
                        ]
                    ],
                    [
                        [
                            "lambda_77",
                            0,
                            0,
                            {}
                        ]
                    ],
                    [
                        [
                            "lambda_80",
                            0,
                            0,
                            {}
                        ]
                    ],
                    [
                        [
                            "lambda_83",
                            0,
                            0,
                            {}
                        ]
                    ],
                    [
                        [
                            "lambda_86",
                            0,
                            0,
                            {}
                        ]
                    ],
                    [
                        [
                            "lambda_89",
                            0,
                            0,
                            {}
                        ]
                    ]
                ]
            },
            {
                "class_name": "Dropout",
                "config": {
                    "name": "dropout",
                    "trainable": true,
                    "dtype": "float32",
                    "rate": 0.5,
                    "noise_shape": null,
                    "seed": null
                },
                "name": "dropout",
                "inbound_nodes": [
                    [
                        [
                            "embedding",
                            0,
                            0,
                            {}
                        ]
                    ]
                ]
            },
            {
                "class_name": "Lambda",
                "config": {
                    "name": "lambda_1",
                    "trainable": true,
                    "dtype": "float32",
                    "function": [
                        "4wEAAAAAAAAAAQAAAAQAAABTAAAAcw4AAAB0AGoBfABkAWQCjQJTACkDTukBAAAAKQHaBGF4aXMp\nAtoBS9oEbWVhbikB2gF4qQByBgAAAPozL2hvbWUvbXN0b3BhL2NvbXB1dGUvSW1hZ2VDYXB0aW9u\nL21vZGVscy9kZWNvZGVyLnB52gg8bGFtYmRhPp0AAADzAAAAAA==\n",
                        null,
                        null
                    ],
                    "function_type": "lambda",
                    "module": "models.decoder",
                    "output_shape": null,
                    "output_shape_type": "raw",
                    "output_shape_module": null,
                    "arguments": {}
                },
                "name": "lambda_1",
                "inbound_nodes": [
                    [
                        [
                            "encoder_input",
                            0,
                            0,
                            {}
                        ]
                    ]
                ]
            },
            {
                "class_name": "Multiply",
                "config": {
                    "name": "multiply",
                    "trainable": true,
                    "dtype": "float32"
                },
                "name": "multiply",
                "inbound_nodes": [
                    [
                        [
                            "dot",
                            0,
                            0,
                            {}
                        ],
                        [
                            "dense_2",
                            0,
                            0,
                            {}
                        ]
                    ]
                ]
            },
            {
                "class_name": "Lambda",
                "config": {
                    "name": "lambda_4",
                    "trainable": true,
                    "dtype": "float32",
                    "function": [
                        "4wIAAAAAAAAAAgAAAAQAAABTAAAAcxoAAAB0AGoBfABkAGQAhQJ8AWYCGQBkAWQCjQJTACkDTukB\nAAAAKQHaBGF4aXMpAtoBS9oLZXhwYW5kX2RpbXMpAtoBeNoBdKkAcgcAAAD6My9ob21lL21zdG9w\nYS9jb21wdXRlL0ltYWdlQ2FwdGlvbi9tb2RlbHMvZGVjb2Rlci5wedoIPGxhbWJkYT6tAAAA8wAA\nAAA=\n",
                        null,
                        null
                    ],
                    "function_type": "lambda",
                    "module": "models.decoder",
                    "output_shape": [
                        "4wEAAAAAAAAAAQAAAAQAAABTAAAAcxIAAAB8AGQBGQBkAnwAZAMZAGYDUwApBE7pAAAAAOkBAAAA\n6QIAAACpACkB2gFzcgQAAAByBAAAAPozL2hvbWUvbXN0b3BhL2NvbXB1dGUvSW1hZ2VDYXB0aW9u\nL21vZGVscy9kZWNvZGVyLnB52gg8bGFtYmRhPq4AAADzAAAAAA==\n",
                        null,
                        null
                    ],
                    "output_shape_type": "lambda",
                    "output_shape_module": "models.decoder",
                    "arguments": {
                        "t": 0
                    }
                },
                "name": "lambda_4",
                "inbound_nodes": [
                    [
                        [
                            "dropout",
                            0,
                            0,
                            {}
                        ]
                    ]
                ]
            },
            {
                "class_name": "Dense",
                "config": {
                    "name": "dense_5",
                    "trainable": true,
                    "dtype": "float32",
                    "units": 512,
                    "activation": "relu",
                    "use_bias": true,
                    "kernel_initializer": {
                        "class_name": "GlorotUniform",
                        "config": {
                            "seed": null
                        }
                    },
                    "bias_initializer": {
                        "class_name": "Zeros",
                        "config": {}
                    },
                    "kernel_regularizer": null,
                    "bias_regularizer": null,
                    "activity_regularizer": null,
                    "kernel_constraint": null,
                    "bias_constraint": null
                },
                "name": "dense_5",
                "inbound_nodes": [
                    [
                        [
                            "lambda_1",
                            0,
                            0,
                            {}
                        ]
                    ]
                ]
            },
            {
                "class_name": "Concatenate",
                "config": {
                    "name": "concatenate",
                    "trainable": true,
                    "dtype": "float32",
                    "axis": -1
                },
                "name": "concatenate",
                "inbound_nodes": [
                    [
                        [
                            "multiply",
                            0,
                            0,
                            {}
                        ],
                        [
                            "lambda_4",
                            0,
                            0,
                            {}
                        ]
                    ]
                ]
            },
            {
                "class_name": "BatchNormalization",
                "config": {
                    "name": "batch_normalization_5",
                    "trainable": true,
                    "dtype": "float32",
                    "axis": [
